In [3]:
import numpy as np
import pandas as pd

# deliveries = pd.read_csv('Datasets/deliveries.csv')
# deliveries.head(3)

data = pd.read_csv('Datasets/train.csv')
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

**dropna()**

In [4]:
data.shape

(891, 12)

In [8]:
data.dropna().shape #deleting rows with na in any columns

(183, 12)

In [10]:
data.dropna(how = 'all').shape # Deleting rows with na in all columns

(891, 12)

In [12]:
data.dropna(axis=1).shape # deleting columns with null value in any rows

(891, 9)

In [14]:
data.dropna(subset=['Cabin', 'Embarked']).shape # deleting rows for null in the specified columns
# This is an or operation, Union

(204, 12)

**fillna()**

In [17]:
##fill the missing value
data.fillna(0).head(3) #replace missing value with 0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,0,S

In [19]:
data['Cabin'].fillna('Not Specified', inplace=True)

In [21]:
data['Age'].fillna(30, inplace=True)

In [30]:
data['Embarked'].fillna(method='ffill') # fill missing values with forward fill

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object